nxp-mcuxpresso/mcux-sdk-examples/evk9mimx8ulp/driver_examples/flexio/spi/int_lpspi_transfer/master/pin_mux.c
/*
 * Copyright 2023 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v13.1
processor: MIMX8UD5xxx08
package_id: MIMX8UD5DVK08
mcu_data: ksdk2_0
processor_version: 0.13.4
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

#include "fsl_common.h"
#include "fsl_iomuxc.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: cm33}
- pin_list:
  - {pin_num: C1, peripheral: LPUART1, signal: lpuart_rx, pin_signal: PTA11, PS: UP, PE: ENABLED}
  - {pin_num: D2, peripheral: LPUART1, signal: lpuart_tx, pin_signal: PTA10, PS: UP, PE: ENABLED}
  - {pin_num: C5, peripheral: LPSPI1, signal: lpspi_sin, pin_signal: PTA16, SRE: SLOW, DSE: HIDRIVE}
  - {pin_num: A3, peripheral: LPSPI1, signal: lpspi_sout, pin_signal: PTA17, SRE: SLOW, DSE: HIDRIVE}
  - {pin_num: D6, peripheral: LPSPI1, signal: 'lpspi_pcs, 0', pin_signal: PTA15, SRE: SLOW, DSE: HIDRIVE}
  - {pin_num: B4, peripheral: LPSPI1, signal: lpspi_sck, pin_signal: PTA18, SRE: SLOW, DSE: HIDRIVE}
  - {pin_num: A9, peripheral: FXIO0, signal: 'fxio_d, 16', pin_signal: PTB0, SRE: SLOW, DSE: HIDRIVE}
  - {pin_num: B10, peripheral: FXIO0, signal: 'fxio_d, 17', pin_signal: PTB1, SRE: SLOW, DSE: HIDRIVE}
  - {pin_num: D12, peripheral: FXIO0, signal: 'fxio_d, 18', pin_signal: PTB2, SRE: SLOW, DSE: HIDRIVE}
  - {pin_num: A11, peripheral: FXIO0, signal: 'fxio_d, 19', pin_signal: PTB3, SRE: SLOW, DSE: HIDRIVE}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void) {                                /*!< Function assigned for the core: Cortex-M33[cm33] */
    IOMUXC_SetPinMux(IOMUXC_PTA10_LPUART1_TX, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PTA10_LPUART1_TX,
                        IOMUXC_PCR_PE_MASK |
                        IOMUXC_PCR_PS_MASK);
    IOMUXC_SetPinMux(IOMUXC_PTA11_LPUART1_RX, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PTA11_LPUART1_RX,
                        IOMUXC_PCR_PE_MASK |
                        IOMUXC_PCR_PS_MASK);
    IOMUXC_SetPinMux(IOMUXC_PTA15_LPSPI1_PCS0, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PTA15_LPSPI1_PCS0,
                        IOMUXC_PCR_DSE_MASK |
                        IOMUXC_PCR_SRE_MASK);
    IOMUXC_SetPinMux(IOMUXC_PTA16_LPSPI1_SIN, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PTA16_LPSPI1_SIN,
                        IOMUXC_PCR_DSE_MASK |
                        IOMUXC_PCR_SRE_MASK);
    IOMUXC_SetPinMux(IOMUXC_PTA17_LPSPI1_SOUT, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PTA17_LPSPI1_SOUT,
                        IOMUXC_PCR_DSE_MASK |
                        IOMUXC_PCR_SRE_MASK);
    IOMUXC_SetPinMux(IOMUXC_PTA18_LPSPI1_SCK, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PTA18_LPSPI1_SCK,
                        IOMUXC_PCR_DSE_MASK |
                        IOMUXC_PCR_SRE_MASK);
    IOMUXC_SetPinMux(IOMUXC_PTB0_FXIO0_D16, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PTB0_FXIO0_D16,
                        IOMUXC_PCR_DSE_MASK |
                        IOMUXC_PCR_SRE_MASK);
    IOMUXC_SetPinMux(IOMUXC_PTB1_FXIO0_D17, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PTB1_FXIO0_D17,
                        IOMUXC_PCR_DSE_MASK |
                        IOMUXC_PCR_SRE_MASK);
    IOMUXC_SetPinMux(IOMUXC_PTB2_FXIO0_D18, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PTB2_FXIO0_D18,
                        IOMUXC_PCR_DSE_MASK |
                        IOMUXC_PCR_SRE_MASK);
    IOMUXC_SetPinMux(IOMUXC_PTB3_FXIO0_D19, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PTB3_FXIO0_D19,
                        IOMUXC_PCR_DSE_MASK |
                        IOMUXC_PCR_SRE_MASK);
}

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
